benchmarks/results/auth-serialization/test-signup/final/wrk2-logs/run_2_2605_1112.txt
Running 30s test @ http://127.0.0.1:8000/api/v1/access/signup
  2 threads and 4 connections
  Thread calibration: mean lat.: 609.898ms, rate sampling interval: 1319ms
  Thread calibration: mean lat.: 611.520ms, rate sampling interval: 1317ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   601.42ms   52.76ms 661.50ms   79.00%
    Req/Sec     2.33      0.79     3.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  605.70ms
 75.000%  650.24ms
 90.000%  654.34ms
 99.000%  662.02ms
 99.900%  662.02ms
 99.990%  662.02ms
 99.999%  662.02ms
100.000%  662.02ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     397.567     0.000000            1         1.00
     542.207     0.100000           10         1.11
     564.223     0.200000           22         1.25
     571.391     0.300000           30         1.43
     574.463     0.400000           40         1.67
     605.695     0.500000           50         2.00
     622.591     0.550000           55         2.22
     644.095     0.600000           60         2.50
     647.679     0.650000           66         2.86
     648.191     0.700000           71         3.33
     650.239     0.750000           77         4.00
     650.751     0.775000           80         4.44
     650.751     0.800000           80         5.00
     652.287     0.825000           83         5.71
     653.311     0.850000           87         6.67
     653.823     0.875000           88         8.00
     654.335     0.887500           90         8.89
     654.335     0.900000           90        10.00
     655.359     0.912500           92        11.43
     656.383     0.925000           95        13.33
     656.383     0.937500           95        16.00
     656.383     0.943750           95        17.78
     656.383     0.950000           95        20.00
     656.895     0.956250           96        22.86
     657.407     0.962500           97        26.67
     657.407     0.968750           97        32.00
     658.431     0.971875           98        35.56
     658.431     0.975000           98        40.00
     658.431     0.978125           98        45.71
     662.015     0.981250          100        53.33
     662.015     1.000000          100          inf
#[Mean    =      601.416, StdDeviation   =       52.758]
#[Max     =      661.504, Total count    =          100]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  148 requests in 30.01s, 59.37KB read
Requests/sec:      4.93
Transfer/sec:      1.98KB