benchmarks/results/auth-serialization/test-signup/final/wrk2-logs/run_3_2605_1113.txt
Running 30s test @ http://127.0.0.1:8000/api/v1/access/signup
  2 threads and 4 connections
  Thread calibration: mean lat.: 615.146ms, rate sampling interval: 1304ms
  Thread calibration: mean lat.: 606.016ms, rate sampling interval: 1302ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   611.77ms   43.70ms 671.23ms   56.00%
    Req/Sec     2.33      0.79     3.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  627.71ms
 75.000%  651.78ms
 90.000%  659.97ms
 99.000%  671.74ms
 99.900%  671.74ms
 99.990%  671.74ms
 99.999%  671.74ms
100.000%  671.74ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     527.359     0.000000            1         1.00
     558.079     0.100000           10         1.11
     566.271     0.200000           20         1.25
     573.439     0.300000           32         1.43
     582.655     0.400000           40         1.67
     627.711     0.500000           50         2.00
     645.631     0.550000           57         2.22
     646.655     0.600000           61         2.50
     648.703     0.650000           68         2.86
     649.727     0.700000           71         3.33
     651.775     0.750000           76         4.00
     653.823     0.775000           78         4.44
     655.359     0.800000           80         5.00
     656.383     0.825000           85         5.71
     656.383     0.850000           85         6.67
     659.455     0.875000           88         8.00
     659.967     0.887500           90         8.89
     659.967     0.900000           90        10.00
     660.991     0.912500           92        11.43
     661.503     0.925000           93        13.33
     662.015     0.937500           95        16.00
     662.015     0.943750           95        17.78
     662.015     0.950000           95        20.00
     662.527     0.956250           96        22.86
     664.575     0.962500           98        26.67
     664.575     0.968750           98        32.00
     664.575     0.971875           98        35.56
     664.575     0.975000           98        40.00
     664.575     0.978125           98        45.71
     671.743     0.981250          100        53.33
     671.743     1.000000          100          inf
#[Mean    =      611.773, StdDeviation   =       43.701]
#[Max     =      671.232, Total count    =          100]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  148 requests in 30.02s, 59.37KB read
Requests/sec:      4.93
Transfer/sec:      1.98KB